In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:viswaa@localhost

In [4]:
%%sql
use besant;
show tables;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
11 rows affected.

[('cricket_players',),
 ('drivers',),
 ('employee',),
 ('employee_sales',),
 ('employees',),
 ('employeess',),
 ('grocery',),
 ('rides',),
 ('sales_data',),
 ('student',),
 ('students',)]

In [5]:
%%sql
CREATE TABLE departments (
    dept_id INT PRIMARY KEY AUTO_INCREMENT,
    dept_name VARCHAR(50),
    manager_name VARCHAR(50),
    location VARCHAR(50),
    phone VARCHAR(20),
    email VARCHAR(50),
    floor_no INT,
    building VARCHAR(50),
    budget DECIMAL(10,2),
    established_year INT
);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [6]:
%%sql
INSERT INTO departments 
(dept_name, manager_name, location, phone, email, floor_no, building, budget, established_year)
VALUES
('HR', 'Alice Brown', 'New York', '111-1111', 'hr@company.com', 1, 'A', 50000.00, 2015),
('Finance', 'John Smith', 'New York', '222-2222', 'finance@company.com', 2, 'A', 80000.00, 2012),
('IT', 'Maria Garcia', 'Boston', '333-3333', 'it@company.com', 3, 'B', 150000.00, 2010),
('Sales', 'David Wilson', 'Chicago', '444-4444', 'sales@company.com', 4, 'B', 100000.00, 2014),
('Marketing', 'Sophia Johnson', 'Chicago', '555-5555', 'marketing@company.com', 5, 'C', 120000.00, 2013),
('Support', 'James Lee', 'Dallas', '666-6666', 'support@company.com', 6, 'C', 60000.00, 2018),
('Logistics', 'Olivia Davis', 'Miami', '777-7777', 'logistics@company.com', 7, 'D', 90000.00, 2016),
('Legal', 'Emma White', 'Seattle', '888-8888', 'legal@company.com', 8, 'E', 70000.00, 2011),
('Admin', 'William Clark', 'Austin', '999-9999', 'admin@company.com', 9, 'F', 40000.00, 2017),
('Research', 'Liam Lewis', 'San Jose', '101-0101', 'research@company.com', 10, 'G', 200000.00, 2009);

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[]

In [7]:
%%sql
drop table employees;
CREATE TABLE employees (
    emp_id INT PRIMARY KEY AUTO_INCREMENT,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    gender ENUM('M','F'),
    job_title VARCHAR(50),
    salary DECIMAL(10,2),
    hire_date DATE,
    email VARCHAR(50),
    phone VARCHAR(20),
    dept_id INT,
    FOREIGN KEY (dept_id) REFERENCES departments(dept_id)
);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [8]:
%%sql
INSERT INTO employees 
(first_name, last_name, gender, job_title, salary, hire_date, email, phone, dept_id)
VALUES
('John', 'Doe', 'M', 'HR Assistant', 35000, '2020-01-15', 'john.doe@company.com', '111-1112', 1),
('Jane', 'Miller', 'F', 'Accountant', 55000, '2019-03-10', 'jane.miller@company.com', '222-3333', 2),
('Alex', 'Brown', 'M', 'IT Analyst', 70000, '2021-05-20', 'alex.brown@company.com', '333-4444', 3),
('Emily', 'Clark', 'F', 'Sales Rep', 60000, '2018-07-25', 'emily.clark@company.com', '444-5555', 4),
('Daniel', 'Adams', 'M', 'Marketing Exec', 65000, '2017-09-30', 'daniel.adams@company.com', '555-6666', 5),
('Olivia', 'Martin', 'F', 'Support Staff', 40000, '2022-02-10', 'olivia.martin@company.com', '666-7777', 6),
('Liam', 'Taylor', 'M', 'Logistics Officer', 55000, '2020-04-12', 'liam.taylor@company.com', '777-8888', 7),
('Sophia', 'Hernandez', 'F', 'Legal Advisor', 75000, '2016-10-18', 'sophia.hernandez@company.com', '888-9999', 8),
('Noah', 'Walker', 'M', 'Admin Officer', 45000, '2021-01-22', 'noah.walker@company.com', '999-0000', 9),
('Ava', 'Anderson', 'F', 'Research Scientist', 95000, '2015-08-14', 'ava.anderson@company.com', '101-2020', 10);

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[]

In [11]:
%%sql
##show the employees wintin their departments
select * from departments left join employees 
on departments.dept_id = employees.dept_id;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[(1, 'HR', 'Alice Brown', 'New York', '111-1111', 'hr@company.com', 1, 'A', Decimal('50000.00'), 2015, 1, 'John', 'Doe', 'M', 'HR Assistant', Decimal('35000.00'), datetime.date(2020, 1, 15), 'john.doe@company.com', '111-1112', 1),
 (2, 'Finance', 'John Smith', 'New York', '222-2222', 'finance@company.com', 2, 'A', Decimal('80000.00'), 2012, 2, 'Jane', 'Miller', 'F', 'Accountant', Decimal('55000.00'), datetime.date(2019, 3, 10), 'jane.miller@company.com', '222-3333', 2),
 (3, 'IT', 'Maria Garcia', 'Boston', '333-3333', 'it@company.com', 3, 'B', Decimal('150000.00'), 2010, 3, 'Alex', 'Brown', 'M', 'IT Analyst', Decimal('70000.00'), datetime.date(2021, 5, 20), 'alex.brown@company.com', '333-4444', 3),
 (4, 'Sales', 'David Wilson', 'Chicago', '444-4444', 'sales@company.com', 4, 'B', Decimal('100000.00'), 2014, 4, 'Emily', 'Clark', 'F', 'Sales Rep', Decimal('60000.00'), datetime.date(2018, 7, 25), 'emily.clark@company.com', '444-5555', 4),
 (5, 'Marketing', 'Sophia Johnson', 'Chicago', '555-5555', 'marketing@company.com', 5, 'C', Decimal('120000.00'), 2013, 5, 'Daniel', 'Adams', 'M', 'Marketing Exec', Decimal('65000.00'), datetime.date(2017, 9, 30), 'daniel.adams@company.com', '555-6666', 5),
 (6, 'Support', 'James Lee', 'Dallas', '666-6666', 'support@company.com', 6, 'C', Decimal('60000.00'), 2018, 6, 'Olivia', 'Martin', 'F', 'Support Staff', Decimal('40000.00'), datetime.date(2022, 2, 10), 'olivia.martin@company.com', '666-7777', 6),
 (7, 'Logistics', 'Olivia Davis', 'Miami', '777-7777', 'logistics@company.com', 7, 'D', Decimal('90000.00'), 2016, 7, 'Liam', 'Taylor', 'M', 'Logistics Officer', Decimal('55000.00'), datetime.date(2020, 4, 12), 'liam.taylor@company.com', '777-8888', 7),
 (8, 'Legal', 'Emma White', 'Seattle', '888-8888', 'legal@company.com', 8, 'E', Decimal('70000.00'), 2011, 8, 'Sophia', 'Hernandez', 'F', 'Legal Advisor', Decimal('75000.00'), datetime.date(2016, 10, 18), 'sophia.hernandez@company.com', '888-9999', 8),
 (9, 'Admin', 'William Clark', 'Austin', '999-9999', 'admin@company.com', 9, 'F', Decimal('40000.00'), 2017, 9, 'Noah', 'Walker', 'M', 'Admin Officer', Decimal('45000.00'), datetime.date(2021, 1, 22), 'noah.walker@company.com', '999-0000', 9),
 (10, 'Research', 'Liam Lewis', 'San Jose', '101-0101', 'research@company.com', 10, 'G', Decimal('200000.00'), 2009, 10, 'Ava', 'Anderson', 'F', 'Research Scientist', Decimal('95000.00'), datetime.date(2015, 8, 14), 'ava.anderson@company.com', '101-2020', 10)]

In [ ]:
%%sql
insert into departments (dept_id) values (11);
insert into employees

In [13]:
%%sql
drop table students;
CREATE TABLE students (
  student_id INT PRIMARY KEY AUTO_INCREMENT,
  first_name VARCHAR(50),
  last_name VARCHAR(50),
  gender ENUM('M','F'),
  age INT,
  city VARCHAR(50),
  email VARCHAR(100),
  phone VARCHAR(20),
  admission_year INT,
  course_id INT
);

INSERT INTO students
(first_name, last_name, gender, age, city, email, phone, admission_year, course_id)
VALUES
('John', 'Doe', 'M', 21, 'New York', 'john@example.com', '555-1111', 2023, 1),
('Jane', 'Smith', 'F', 22, 'Boston', 'jane@example.com', '555-2222', 2022, 2),
('Alex', 'Brown', 'M', 20, 'Chicago', 'alex@example.com', '555-3333', 2023, 3),
('Emily', 'Clark', 'F', 23, 'Dallas', 'emily@example.com', '555-4444', 2021, 4),
('Daniel', 'Adams', 'M', 24, 'Miami', 'daniel@example.com', '555-5555', 2020, 5),
('Sophia', 'Johnson', 'F', 21, 'Seattle', 'sophia@example.com', '555-6666', 2023, 6),
('Liam', 'Taylor', 'M', 22, 'Denver', 'liam@example.com', '555-7777', 2022, 7),
('Olivia', 'Martinez', 'F', 20, 'Houston', 'olivia@example.com', '555-8888', 2023, 8),
('Noah', 'Walker', 'M', 23, 'San Diego', 'noah@example.com', '555-9999', 2021, 9),
('Ava', 'Lopez', 'F', 19, 'Austin', 'ava@example.com', '555-0000', 2024, 10);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.
10 rows affected.

[]

In [14]:
%%sql
CREATE TABLE courses (
  course_id INT PRIMARY KEY AUTO_INCREMENT,
  course_name VARCHAR(100),
  department VARCHAR(50),
  duration_months INT,
  credits INT,
  instructor VARCHAR(100),
  room_no VARCHAR(10),
  schedule VARCHAR(50),
  start_date DATE,
  fee DECIMAL(10,2)
);

INSERT INTO courses
(course_name, department, duration_months, credits, instructor, room_no, schedule, start_date, fee)
VALUES
('Database Systems', 'Computer Science', 6, 4, 'Dr. Allen', 'B101', 'Mon-Wed 9-11', '2024-01-10', 500.00),
('Web Development', 'Computer Science', 6, 4, 'Dr. Kim', 'B102', 'Tue-Thu 10-12', '2024-01-15', 600.00),
('Networking Basics', 'IT', 4, 3, 'Dr. Clark', 'B103', 'Mon-Wed 1-3', '2024-02-01', 450.00),
('AI Fundamentals', 'Computer Science', 8, 5, 'Dr. White', 'B104', 'Fri 9-12', '2024-01-20', 800.00),
('Cloud Computing', 'IT', 6, 4, 'Dr. Davis', 'B105', 'Tue-Thu 2-4', '2024-02-05', 700.00),
('Data Structures', 'Computer Science', 5, 4, 'Dr. Smith', 'B106', 'Mon-Wed 11-1', '2024-01-25', 550.00),
('Software Testing', 'IT', 4, 3, 'Dr. Patel', 'B107', 'Fri 1-3', '2024-03-01', 400.00),
('Machine Learning', 'Computer Science', 8, 5, 'Dr. Lee', 'B108', 'Tue-Thu 3-5', '2024-01-30', 900.00),
('Cyber Security', 'IT', 6, 4, 'Dr. Adams', 'B109', 'Mon-Wed 3-5', '2024-02-10', 650.00),
('Mobile App Dev', 'IT', 5, 4, 'Dr. Brown', 'B110', 'Tue-Thu 9-11', '2024-02-15', 600.00);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
10 rows affected.

[]

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql